lib/__tests__/fixtures/clients.test.req1.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:sac="http://ws.pagamenti.telematici.gov/" xmlns:tns="http://PuntoAccessoPSP.spcoop.gov.it/servizi/IscrizioniAvvisatura">
  <soapenv:Body>
    <sac:nodoAggiornaIscrizioniAvvisatura xmlns:sac="http://ws.pagamenti.telematici.gov/">
      <identificativoPSP>CDPSP</identificativoPSP>
      <identificativoIntermediarioPSP>123</identificativoIntermediarioPSP>
      <identificativoCanale>456</identificativoCanale>
      <password>password</password>
      <datiNotifica>
        <dataOraRichiesta>2018-04-03T16:41:00</dataOraRichiesta>
        <identificativoMessaggioRichiesta>1</identificativoMessaggioRichiesta>
        <identificativoUnivocoSoggetto>
          <sac:tipoIdentificativoUnivoco>F</sac:tipoIdentificativoUnivoco>
          <sac:codiceIdentificativoUnivoco>FISCAL_CODE</sac:codiceIdentificativoUnivoco>
        </identificativoUnivocoSoggetto>
        <azioneDiAggiornamento>A</azioneDiAggiornamento>
      </datiNotifica>
    </sac:nodoAggiornaIscrizioniAvvisatura>
  </soapenv:Body>
</soapenv:Envelope>